<a href="https://colab.research.google.com/github/danielcdo/-MachineLearning/blob/main/titanicLogisticRegression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Logistic Regression Model

**Dataset:** Titanic kaggle source - https://www.kaggle.com/c/titanic/overview

##Import Relevant Packages

In [2]:
import numpy as np
import pandas as pd
from pandas.plotting import scatter_matrix

Function to load  the dataset into Pandas daframe stored at my GitHub repository.

In [14]:
def load_data(dataset_url, filename):
  ''' Replace github.com by raw.githubusercontent.com. Provide the URL for the raw dataset.'''
    return pd.read_csv(dataset_url + filename)
print('Defined load_data function.')

Defined load_data function.

Titanic dataset stored in GitHub. Provide the raw URL repository.

In [16]:
# Replace github.com by raw.githubusercontent.com
# provide the URL for the raw dataset
# original URL: https://github.com/danielcdo/-MachineLearning/tree/main/datasets/titanic

DOWNLOAD_ROOT = 'https://raw.githubusercontent.com/danielcdo/-MachineLearning/main/datasets/titanic/'

## Exploratory Data Analysis - EDA
## Quick glance at the data

***Details***: dataset already splitted in train and test

In [25]:
# call load_data function
train = load_data(dataset_url=DOWNLOAD_ROOT, filename='train.csv')

train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [26]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64